
#Автор Тютин Руслан
#Цикл
#
#Ввести с клавиатуры строку.
#Вывести эту же строку вертикально: по одному символу на строку консоли.

strings = input("Введите строку: ")
for string in strings:
    print(string)

